#Написать развернутый ответ к задаче №9
a, b, c = int(input('a=')), int(input('b=')), int(input('c='))
p = (a + b +c)/2
s = (p*(p-a)*(p-b)*(p-c))**0.5
print(f'Площадь треугольника со сторонами {a},{b},{c} равна {float(s)},'
      f'\n а полупериметр равен {float(p)}.')